{
  "recommendations": {
    "RE:01": {"id": "RE:01", "title": "Design for redundancy", "description": "Design your workload to be redundant across zones and regions as appropriate. Build in redundancy to eliminate single points of failure.", "pillar": "Reliability", "content": "Design your application architecture to be zone-redundant when possible and region-redundant when necessary. Set up redundancy for single points of failure including management and control plane components. Implement automated failover mechanisms and test them regularly to ensure they work as expected during actual outages.", "service": null },
    "RE:02": {"id": "RE:02", "title": "Identify flows", "description": "Identify and catalog critical system flows to understand dependencies and failure modes.", "pillar": "Reliability", "content": "Document all critical system flows including data flows, API call chains, and inter-service dependencies. Use this catalog to perform failure mode analysis and identify potential weak points in your architecture.", "service": null },
    "RE:03": {"id": "RE:03", "title": "Use failure mode analysis", "description": "Conduct failure mode analysis to identify and mitigate potential failure points.", "pillar": "Reliability", "content": "Perform comprehensive failure mode and effects analysis (FMEA) on your system. Identify single points of failure, cascading failure scenarios, and implement mitigations such as circuit breakers, bulkheads, and graceful degradation patterns.", "service": null },
    "RE:04": {"id": "RE:04", "title": "Define reliability targets", "description": "Establish clear reliability targets including SLOs, SLAs, and SLIs for your workload.", "pillar": "Reliability", "content": "Define service level objectives (SLOs), service level agreements (SLAs), and service level indicators (SLIs) for your workload. Set recovery time objectives (RTO) and recovery point objectives (RPO) based on business requirements. Monitor these metrics continuously and adjust your architecture to meet them.", "service": null },
    "RE:05": {"id": "RE:05", "title": "Strengthen resiliency and recoverability", "description": "Implement patterns and practices that strengthen system resiliency and enable rapid recovery.", "pillar": "Reliability", "content": "Implement retry policies with exponential backoff, circuit breakers, and timeout strategies. Design for graceful degradation when dependencies fail. Implement health checks and automated recovery procedures. Test recovery procedures regularly through chaos engineering.", "service": null },
    "RE:06": {"id": "RE:06", "title": "Use data replication", "description": "Implement appropriate data replication strategies to ensure data durability and availability.", "pillar": "Reliability", "content": "Configure data replication across availability zones and regions based on your RPO and RTO requirements. Use geo-replication for critical data. Implement proper backup strategies with automated testing of restore procedures. Consider using Azure Site Recovery for disaster recovery scenarios.", "service": null },
    "RE:07": {"id": "RE:07", "title": "Use background jobs", "description": "Offload long-running and non-critical operations to background jobs to improve responsiveness.", "pillar": "Reliability", "content": "Use message queues and background workers to handle asynchronous operations. Implement idempotent message processing. Use dead-letter queues for failed messages. Monitor queue depths and processing times to identify bottlenecks.", "service": null },
    "RE:08": {"id": "RE:08", "title": "Design a reliability testing strategy", "description": "Implement comprehensive testing including chaos engineering to validate reliability.", "pillar": "Reliability", "content": "Conduct regular reliability testing including load testing, stress testing, and chaos engineering experiments. Test failover procedures, backup and restore operations, and disaster recovery plans. Use Azure Chaos Studio to inject failures and validate system behavior.", "service": null },
    "RE:09": {"id": "RE:09", "title": "Implement disaster recovery", "description": "Design and implement disaster recovery procedures to handle regional outages.", "pillar": "Reliability", "content": "Establish disaster recovery procedures for regional failures. Implement automated failover to secondary regions. Regularly test DR procedures to ensure they work as expected. Document runbooks for disaster recovery scenarios and train operations teams.", "service": null },
    "RE:10": {"id": "RE:10", "title": "Monitor infrastructure", "description": "Implement comprehensive monitoring to detect and respond to reliability issues.", "pillar": "Reliability", "content": "Use Azure Monitor to track system health, availability metrics, and performance indicators. Set up alerts for anomalies and threshold breaches. Implement distributed tracing to diagnose issues across microservices. Use Application Insights for application-level monitoring.", "service": null },
    "SE:01": {"id": "SE:01", "title": "Establish a security baseline", "description": "Define and enforce a security baseline for your workload aligned with organizational policies.", "pillar": "Security", "content": "Establish security baselines using Azure Policy and Microsoft Defender for Cloud. Implement Azure security benchmarks. Regularly review and update security baselines to address evolving threats. Use Microsoft Defender for Cloud Secure Score to track security posture.", "service": null },
    "SE:02": {"id": "SE:02", "title": "Maintain a secure development lifecycle", "description": "Integrate security practices throughout the software development lifecycle.", "pillar": "Security", "content": "Implement secure coding practices and conduct security code reviews. Use static application security testing (SAST) and dynamic application security testing (DAST). Scan dependencies for vulnerabilities. Implement security gates in CI/CD pipelines using tools like GitHub Advanced Security.", "service": null },
    "SE:03": {"id": "SE:03", "title": "Classify and protect data", "description": "Classify data based on sensitivity and apply appropriate protection mechanisms.", "pillar": "Security", "content": "Classify data based on sensitivity and compliance requirements. Apply appropriate encryption for data at rest and in transit. Use Azure Information Protection for data classification and protection. Implement data loss prevention (DLP) policies. Regularly audit data access and usage.", "service": null },
    "SE:04": {"id": "SE:04", "title": "Create segmentation and perimeters", "description": "Implement network segmentation and security perimeters to limit blast radius.", "pillar": "Security", "content": "Use virtual networks, subnets, and network security groups to create security boundaries. Implement micro-segmentation using application security groups. Use Azure Firewall or third-party network virtual appliances. Follow zero-trust principles with explicit verification at each layer.", "service": null },
    "SE:05": {"id": "SE:05", "title": "Manage identity and access", "description": "Implement robust identity and access management with least privilege principles.", "pillar": "Security", "content": "Use Microsoft Entra ID (Azure AD) for identity management. Implement role-based access control (RBAC) with least privilege. Use managed identities for Azure resources. Enforce multi-factor authentication (MFA). Implement Privileged Identity Management (PIM) for privileged access. Regularly review access rights.", "service": null },
    "SE:06": {"id": "SE:06", "title": "Isolate network traffic", "description": "Implement network isolation to protect sensitive workloads and data.", "pillar": "Security", "content": "Use virtual network peering and private endpoints to isolate traffic. Implement Azure Private Link for PaaS services. Use service endpoints where private endpoints are not available. Avoid exposing services directly to the internet. Use application gateways and load balancers as security choke points.", "service": null },
    "SE:07": {"id": "SE:07", "title": "Encrypt data", "description": "Implement encryption for data at rest, in transit, and in use.", "pillar": "Security", "content": "Enable encryption for all Azure services. Use TLS 1.2 or higher for data in transit. Use Azure Key Vault for key management. Consider using customer-managed keys for sensitive data. Implement Azure Disk Encryption for VM disks. Use transparent data encryption (TDE) for databases.", "service": null },
    "SE:08": {"id": "SE:08", "title": "Harden resources", "description": "Apply security hardening to all resources following industry best practices.", "pillar": "Security", "content": "Apply OS hardening using CIS benchmarks. Disable unnecessary services and ports. Keep systems patched using Azure Update Management. Use just-in-time (JIT) VM access. Implement endpoint protection using Microsoft Defender for Endpoint. Regular vulnerability assessments.", "service": null },
    "SE:09": {"id": "SE:09", "title": "Protect application secrets", "description": "Store and manage application secrets securely using proper secret management services.", "pillar": "Security", "content": "Store secrets, certificates, and keys in Azure Key Vault. Use managed identities to access Key Vault. Never store secrets in code or configuration files. Rotate secrets regularly. Use Key Vault references in App Service and Function Apps. Implement secret scanning in repositories.", "service": null },
    "SE:10": {"id": "SE:10", "title": "Monitor and detect threats", "description": "Implement comprehensive security monitoring and threat detection.", "pillar": "Security", "content": "Enable Microsoft Defender for Cloud for all subscriptions. Use Azure Sentinel for security information and event management (SIEM). Configure diagnostic logging for all resources. Monitor for suspicious activities and anomalies. Implement threat intelligence integration. Set up automated response for common threats.", "service": null },
    "SE:11": {"id": "SE:11", "title": "Establish incident response procedures", "description": "Define and test incident response procedures for security events.", "pillar": "Security", "content": "Develop and document incident response plans. Define roles and responsibilities for security incidents. Establish communication protocols. Conduct regular tabletop exercises. Use Azure Sentinel playbooks for automated response. Maintain forensic capabilities for post-incident analysis.", "service": null },
    "SE:12": {"id": "SE:12", "title": "Test security defenses", "description": "Regularly test security controls through penetration testing and security assessments.", "pillar": "Security", "content": "Conduct regular penetration testing and vulnerability assessments. Perform red team/blue team exercises. Test incident response procedures. Use Azure Security Center recommendations to identify weaknesses. Implement bug bounty programs for external security researchers.", "service": null },
    "CO:01": {"id": "CO:01", "title": "Create a culture of financial responsibility", "description": "Establish organizational practices that promote cost awareness and accountability.", "pillar": "Cost Optimization", "content": "Foster cost awareness across development and operations teams. Implement cost tagging strategies for resource attribution. Establish cost budgets and alerts. Create showback or chargeback models. Hold regular cost review meetings with stakeholders.", "service": null },
    "CO:02": {"id": "CO:02", "title": "Establish a cost model", "description": "Create a comprehensive cost model for your workload to track and predict spending.", "pillar": "Cost Optimization", "content": "Build detailed cost models that map resources to business units and applications. Use Azure Cost Management to track spending. Implement resource tagging for cost allocation. Create forecasts and budgets based on historical data and growth projections.", "service": null },
    "CO:03": {"id": "CO:03", "title": "Collect and review cost data", "description": "Regularly collect and analyze cost data to identify optimization opportunities.", "pillar": "Cost Optimization", "content": "Use Azure Cost Management and Azure Advisor for cost insights. Export cost data for detailed analysis. Review spending trends monthly. Identify cost anomalies and investigate promptly. Use Azure Cost Management APIs for custom reporting.", "service": null },
    "CO:04": {"id": "CO:04", "title": "Set spending guardrails", "description": "Implement policies and controls to prevent unexpected cost overruns.", "pillar": "Cost Optimization", "content": "Use Azure Policy to enforce resource SKU restrictions. Implement spending limits and alerts. Use Azure Cost Management budgets with action groups. Restrict who can create expensive resources. Implement approval workflows for large resource provisioning.", "service": null },
    "CO:05": {"id": "CO:05", "title": "Get the best rates from providers", "description": "Leverage pricing models and commitments to reduce infrastructure costs.", "pillar": "Cost Optimization", "content": "Use Azure Reservations for predictable workloads (1-year or 3-year commitments). Leverage Azure Hybrid Benefit for Windows Server and SQL Server. Use Azure Savings Plans for compute. Take advantage of spot VMs for interruptible workloads. Negotiate enterprise agreements for volume discounts.", "service": null },
    "CO:06": {"id": "CO:06", "title": "Align usage to billing increments", "description": "Optimize resource usage to match billing units and minimize waste.", "pillar": "Cost Optimization", "content": "Understand billing increments for Azure services. Consolidate workloads to reduce per-unit costs. Use auto-scaling to match demand. Shut down non-production resources during off-hours. Right-size resources to avoid paying for unused capacity.", "service": null },
    "CO:07": {"id": "CO:07", "title": "Optimize component costs", "description": "Review and optimize costs for individual Azure components and services.", "pillar": "Cost Optimization", "content": "Use Azure Advisor recommendations for cost optimization. Right-size VMs based on actual utilization. Use cheaper storage tiers for infrequently accessed data. Optimize database configurations. Delete unused resources like unattached disks and old snapshots.", "service": null },
    "CO:08": {"id": "CO:08", "title": "Optimize environment costs", "description": "Reduce costs by optimizing non-production environments.", "pillar": "Cost Optimization", "content": "Use smaller SKUs for non-production environments. Shut down dev/test resources outside business hours using Azure Automation. Use Azure Dev/Test subscriptions for discounted rates. Share resources across environments where possible. Use ephemeral environments that are created and destroyed on demand.", "service": null },
    "CO:09": {"id": "CO:09", "title": "Optimize flow costs", "description": "Reduce costs associated with data movement and network traffic.", "pillar": "Cost Optimization", "content": "Minimize cross-region data transfers. Use Azure CDN to reduce origin traffic. Implement data compression. Use Azure Front Door for global routing efficiency. Optimize API call patterns to reduce unnecessary requests. Use caching to minimize backend calls.", "service": null },
    "CO:10": {"id": "CO:10", "title": "Optimize data costs", "description": "Implement strategies to reduce data storage and processing costs.", "pillar": "Cost Optimization", "content": "Use appropriate storage tiers (Hot, Cool, Archive) based on access patterns. Implement lifecycle management policies to automatically transition data. Delete obsolete data. Compress data where appropriate. Use Azure Blob Storage reserved capacity for predictable storage needs.", "service": null },
    "CO:11": {"id": "CO:11", "title": "Optimize code costs", "description": "Improve code efficiency to reduce compute and resource consumption.", "pillar": "Cost Optimization", "content": "Profile application performance to identify inefficiencies. Optimize database queries. Reduce memory footprint. Use asynchronous operations to improve throughput. Optimize container image sizes. Use serverless compute where appropriate to pay only for actual usage.", "service": null },
    "CO:12": {"id": "CO:12", "title": "Optimize scaling costs", "description": "Implement cost-effective scaling strategies that match demand patterns.", "pillar": "Cost Optimization", "content": "Use auto-scaling based on metrics that reflect actual demand. Implement scheduled scaling for predictable patterns. Use scale-to-zero for serverless services. Consider using Azure Functions consumption plan for event-driven workloads. Use application-level caching to reduce backend scaling needs.", "service": null },
    "CO:13": {"id": "CO:13", "title": "Optimize personnel time", "description": "Reduce operational costs by improving team efficiency and automation.", "pillar": "Cost Optimization", "content": "Automate repetitive tasks to free up team capacity. Use infrastructure as code to improve deployment efficiency. Implement self-service capabilities for developers. Use Azure Automation and Logic Apps for operational tasks. Invest in monitoring and alerting to reduce mean time to recovery (MTTR).", "service": null },
    "CO:14": {"id": "CO:14", "title": "Consolidate resources", "description": "Reduce costs through resource consolidation and multi-tenancy where appropriate.", "pillar": "Cost Optimization", "content": "Consolidate multiple small databases into elastic pools. Use multi-tenant architectures where appropriate. Share infrastructure across applications. Use container orchestration to improve resource utilization. Consolidate monitoring and logging infrastructure.", "service": null },
    "OE:01": {"id": "OE:01", "title": "Determine workload team members needs", "description": "Identify and provide resources, training, and tools needed by the workload team.", "pillar": "Operational Excellence", "content": "Assess team skills and identify training needs. Provide access to necessary tools and resources. Establish clear roles and responsibilities. Foster a culture of continuous learning. Invest in certifications and professional development for team members.", "service": null },
    "OE:02": {"id": "OE:02", "title": "Formalize the way you run routine and nonroutine tasks", "description": "Document and standardize operational procedures and runbooks.", "pillar": "Operational Excellence", "content": "Create comprehensive runbooks for operational tasks. Document incident response procedures. Standardize deployment processes. Establish change management processes. Use Azure Automation for routine tasks. Maintain up-to-date operational documentation.", "service": null },
    "OE:03": {"id": "OE:03", "title": "Formalize software development management practices", "description": "Implement structured software development lifecycle practices.", "pillar": "Operational Excellence", "content": "Adopt agile development practices. Implement code review processes. Use version control for all artifacts. Establish branching strategies. Define definition of done criteria. Use work item tracking systems. Conduct regular retrospectives.", "service": null },
    "OE:04": {"id": "OE:04", "title": "Optimize software development and quality assurance processes", "description": "Continuously improve development and testing practices for better quality.", "pillar": "Operational Excellence", "content": "Implement automated testing (unit, integration, end-to-end). Use continuous integration to catch issues early. Implement test-driven development (TDD) practices. Conduct load and performance testing. Use code quality tools and enforce standards. Implement shift-left security practices.", "service": null },
    "OE:05": {"id": "OE:05", "title": "Prepare resources and their configurations", "description": "Use infrastructure as code and configuration management for consistency.", "pillar": "Operational Excellence", "content": "Use infrastructure as code (Bicep, Terraform, ARM templates). Store IaC in version control. Implement automated validation and testing of infrastructure code. Use Azure Policy for governance. Implement configuration drift detection. Use Azure Blueprints for standardized environments.", "service": null },
    "OE:06": {"id": "OE:06", "title": "Design a workload supply chain", "description": "Establish secure and reliable pipelines for building and deploying software.", "pillar": "Operational Excellence", "content": "Implement CI/CD pipelines using Azure DevOps or GitHub Actions. Secure the software supply chain. Use artifact management. Implement dependency scanning. Sign and verify artifacts. Use separate pipelines for different environments. Implement approval gates for production deployments.", "service": null },
    "OE:07": {"id": "OE:07", "title": "Design a deployment failure mitigation strategy", "description": "Implement strategies to detect and mitigate deployment failures quickly.", "pillar": "Operational Excellence", "content": "Implement blue-green or canary deployments. Use feature flags to control rollout. Implement automated rollback capabilities. Monitor key metrics during deployments. Use deployment rings to gradually roll out changes. Test rollback procedures regularly.", "service": null },
    "OE:08": {"id": "OE:08", "title": "Design an emergency response strategy", "description": "Establish procedures for responding to critical incidents and outages.", "pillar": "Operational Excellence", "content": "Develop incident response plans for various scenarios. Establish on-call rotations and escalation procedures. Use incident management tools. Conduct post-incident reviews (blameless post-mortems). Maintain communication channels for incidents. Practice emergency procedures through game days.", "service": null },
    "OE:09": {"id": "OE:09", "title": "Automate all tasks", "description": "Identify and automate manual operational tasks to reduce errors and improve efficiency.", "pillar": "Operational Excellence", "content": "Identify repetitive manual tasks for automation. Use Azure Automation for operational tasks. Implement self-healing capabilities. Use Azure Logic Apps for workflow automation. Automate scaling operations. Create automated reports and dashboards.", "service": null },
    "OE:10": {"id": "OE:10", "title": "Design and implement automation", "description": "Build robust automation that is maintainable and testable.", "pillar": "Operational Excellence", "content": "Write automation code with the same rigor as application code. Use version control for automation scripts. Implement error handling in automation. Test automation in non-production environments. Document automation workflows. Use idempotent operations. Implement logging and monitoring for automation.", "service": null },
    "OE:11": {"id": "OE:11", "title": "Use safe deployment practices", "description": "Implement deployment strategies that minimize risk and enable quick recovery.", "pillar": "Operational Excellence", "content": "Use progressive exposure deployment patterns (canary, blue-green, ring-based). Implement automated testing in deployment pipelines. Monitor key metrics during rollout. Have rollback procedures ready. Use feature flags for runtime control. Deploy during low-traffic periods. Communicate deployment schedules to stakeholders.", "service": null },
    "PE:01": {"id": "PE:01", "title": "Negotiate realistic performance targets", "description": "Establish measurable and achievable performance targets based on business requirements.", "pillar": "Performance Efficiency", "content": "Define performance requirements early in the design phase. Establish latency, throughput, and concurrency targets. Set realistic SLOs based on business needs and technical constraints. Document performance requirements for each critical flow. Balance performance targets with cost considerations.", "service": null },
    "PE:02": {"id": "PE:02", "title": "Conduct capacity planning", "description": "Plan for current and future capacity needs to ensure performance at scale.", "pillar": "Performance Efficiency", "content": "Analyze current and projected workload patterns. Plan for growth and seasonal variations. Conduct load testing to understand capacity limits. Monitor resource utilization trends. Use Azure Monitor capacity planning features. Plan for burst capacity needs.", "service": null },
    "PE:03": {"id": "PE:03", "title": "Select the right services", "description": "Choose Azure services that best match your performance requirements.", "pillar": "Performance Efficiency", "content": "Evaluate Azure services based on performance characteristics. Use premium SKUs when performance justifies the cost. Choose appropriate compute options (VMs, containers, serverless). Select database services that match access patterns. Use Azure service SLAs as a guide for reliability and performance expectations.", "service": null },
    "PE:04": {"id": "PE:04", "title": "Collect performance data", "description": "Implement comprehensive performance monitoring and telemetry.", "pillar": "Performance Efficiency", "content": "Use Azure Monitor and Application Insights for performance telemetry. Track key performance indicators (response time, throughput, error rates). Implement distributed tracing for microservices. Use performance counters and metrics. Set up dashboards for real-time performance visibility. Establish baselines for normal performance.", "service": null },
    "PE:05": {"id": "PE:05", "title": "Optimize scaling", "description": "Implement effective scaling strategies to maintain performance under varying load.", "pillar": "Performance Efficiency", "content": "Use auto-scaling based on appropriate metrics (CPU, memory, queue depth, custom metrics). Implement horizontal scaling for stateless components. Use vertical scaling judiciously for stateful components. Pre-warm resources for predictable load spikes. Use Azure Front Door or Traffic Manager for global load distribution.", "service": null },
    "PE:06": {"id": "PE:06", "title": "Optimize data usage", "description": "Implement efficient data access patterns and storage strategies.", "pillar": "Performance Efficiency", "content": "Use appropriate data storage services for access patterns. Implement data partitioning and sharding strategies. Use read replicas for read-heavy workloads. Minimize data movement across regions. Implement appropriate indexing strategies. Use data compression where appropriate.", "service": null },
    "PE:07": {"id": "PE:07", "title": "Optimize code", "description": "Write efficient code that minimizes resource consumption and maximizes throughput.", "pillar": "Performance Efficiency", "content": "Profile application code to identify bottlenecks. Optimize expensive operations and algorithms. Use asynchronous programming patterns. Minimize blocking operations. Optimize memory usage and garbage collection. Use connection pooling for database and HTTP connections. Implement efficient serialization.", "service": null },
    "PE:08": {"id": "PE:08", "title": "Optimize data access", "description": "Implement caching and efficient data access patterns to reduce latency.", "pillar": "Performance Efficiency", "content": "Implement caching at multiple levels (CDN, application, database). Use Azure Cache for Redis for distributed caching. Implement cache-aside pattern for database access. Use appropriate cache eviction policies. Minimize database round trips through batching. Use stored procedures or materialized views for complex queries.", "service": null },
    "PE:09": {"id": "PE:09", "title": "Prioritize network performance", "description": "Optimize network architecture and configuration for low latency and high throughput.", "pillar": "Performance Efficiency", "content": "Use Azure regions closest to users. Implement Azure Front Door or CDN for global distribution. Use ExpressRoute for consistent network performance. Enable accelerated networking on VMs. Optimize network topology to minimize hops. Use private endpoints to avoid internet routing.", "service": null },
    "PE:10": {"id": "PE:10", "title": "Optimize operational tasks", "description": "Ensure operational activities don't negatively impact application performance.", "pillar": "Performance Efficiency", "content": "Schedule maintenance tasks during low-traffic periods. Use snapshot backups to minimize impact. Implement index maintenance strategies that don't block operations. Use read replicas for reporting queries. Optimize log collection and retention. Use sampling for high-volume telemetry.", "service": null },
    "PE:11": {"id": "PE:11", "title": "Respond to live performance issues", "description": "Establish processes to detect and respond quickly to performance degradation.", "pillar": "Performance Efficiency", "content": "Set up performance alerts with appropriate thresholds. Implement automated responses for common issues. Have runbooks ready for performance incidents. Use Azure Monitor autoscale for automatic adjustments. Maintain performance baselines to detect anomalies. Practice performance incident response through game days.", "service": null },
    "PE:12": {"id": "PE:12", "title": "Continuously optimize performance", "description": "Establish a culture of continuous performance improvement and optimization.", "pillar": "Performance Efficiency", "content": "Regularly review performance metrics and trends. Conduct periodic load testing and performance reviews. Stay updated on Azure service improvements and new features. Optimize based on actual usage patterns. Implement performance regression testing in CI/CD. Share performance insights across teams.", "service": null }
  },
  "checklists": {
    "reliability": {"pillar": "Reliability", "items": [{"id": "RE:01", "title": "Design for redundancy", "description": "Build redundancy across zones and regions"}, {"id": "RE:02", "title": "Identify flows", "description": "Catalog critical system flows"}, {"id": "RE:03", "title": "Use failure mode analysis", "description": "Identify and mitigate failure points"}, {"id": "RE:04", "title": "Define reliability targets", "description": "Establish SLOs, SLAs, and SLIs"}, {"id": "RE:05", "title": "Strengthen resiliency", "description": "Implement resilience patterns"}, {"id": "RE:06", "title": "Use data replication", "description": "Ensure data durability"}, {"id": "RE:07", "title": "Use background jobs", "description": "Offload long-running operations"}, {"id": "RE:08", "title": "Design testing strategy", "description": "Validate reliability through testing"}, {"id": "RE:09", "title": "Implement disaster recovery", "description": "Handle regional outages"}, {"id": "RE:10", "title": "Monitor infrastructure", "description": "Detect reliability issues"}]},
    "security": {"pillar": "Security", "items": [{"id": "SE:01", "title": "Establish security baseline", "description": "Define security standards"}, {"id": "SE:02", "title": "Secure development lifecycle", "description": "Integrate security in SDLC"}, {"id": "SE:03", "title": "Classify and protect data", "description": "Apply data protection"}, {"id": "SE:04", "title": "Create segmentation", "description": "Implement network boundaries"}, {"id": "SE:05", "title": "Manage identity and access", "description": "Enforce least privilege"}, {"id": "SE:06", "title": "Isolate network traffic", "description": "Protect with network isolation"}, {"id": "SE:07", "title": "Encrypt data", "description": "Encrypt at rest and in transit"}, {"id": "SE:08", "title": "Harden resources", "description": "Apply security hardening"}, {"id": "SE:09", "title": "Protect secrets", "description": "Secure secret management"}, {"id": "SE:10", "title": "Monitor threats", "description": "Detect security threats"}, {"id": "SE:11", "title": "Incident response", "description": "Handle security incidents"}, {"id": "SE:12", "title": "Test security", "description": "Validate security controls"}]},
    "cost optimization": {"pillar": "Cost Optimization", "items": [{"id": "CO:01", "title": "Financial responsibility", "description": "Foster cost awareness"}, {"id": "CO:02", "title": "Establish cost model", "description": "Track and predict spending"}, {"id": "CO:03", "title": "Review cost data", "description": "Analyze spending trends"}, {"id": "CO:04", "title": "Set spending guardrails", "description": "Prevent cost overruns"}, {"id": "CO:05", "title": "Get best rates", "description": "Leverage pricing models"}, {"id": "CO:06", "title": "Align to billing", "description": "Match billing units"}, {"id": "CO:07", "title": "Optimize components", "description": "Reduce component costs"}, {"id": "CO:08", "title": "Optimize environments", "description": "Reduce non-prod costs"}, {"id": "CO:09", "title": "Optimize flows", "description": "Reduce data transfer costs"}, {"id": "CO:10", "title": "Optimize data", "description": "Reduce storage costs"}, {"id": "CO:11", "title": "Optimize code", "description": "Improve code efficiency"}, {"id": "CO:12", "title": "Optimize scaling", "description": "Cost-effective scaling"}, {"id": "CO:13", "title": "Optimize personnel", "description": "Improve team efficiency"}, {"id": "CO:14", "title": "Consolidate resources", "description": "Reduce through consolidation"}]},
    "operational excellence": {"pillar": "Operational Excellence", "items": [{"id": "OE:01", "title": "Determine team needs", "description": "Provide resources and training"}, {"id": "OE:02", "title": "Formalize tasks", "description": "Document operational procedures"}, {"id": "OE:03", "title": "Formalize development", "description": "Structured SDLC practices"}, {"id": "OE:04", "title": "Optimize development", "description": "Improve quality practices"}, {"id": "OE:05", "title": "Prepare resources", "description": "Use infrastructure as code"}, {"id": "OE:06", "title": "Design supply chain", "description": "Secure build pipelines"}, {"id": "OE:07", "title": "Mitigate deployment failures", "description": "Handle deployment issues"}, {"id": "OE:08", "title": "Emergency response", "description": "Handle critical incidents"}, {"id": "OE:09", "title": "Automate tasks", "description": "Reduce manual operations"}, {"id": "OE:10", "title": "Implement automation", "description": "Build robust automation"}, {"id": "OE:11", "title": "Safe deployment", "description": "Minimize deployment risk"}]},
    "performance efficiency": {"pillar": "Performance Efficiency", "items": [{"id": "PE:01", "title": "Negotiate targets", "description": "Set performance goals"}, {"id": "PE:02", "title": "Capacity planning", "description": "Plan for scale"}, {"id": "PE:03", "title": "Select services", "description": "Choose right Azure services"}, {"id": "PE:04", "title": "Collect performance data", "description": "Monitor performance"}, {"id": "PE:05", "title": "Optimize scaling", "description": "Effective auto-scaling"}, {"id": "PE:06", "title": "Optimize data usage", "description": "Efficient data patterns"}, {"id": "PE:07", "title": "Optimize code", "description": "Write efficient code"}, {"id": "PE:08", "title": "Optimize data access", "description": "Implement caching"}, {"id": "PE:09", "title": "Network performance", "description": "Optimize network"}, {"id": "PE:10", "title": "Optimize operations", "description": "Minimize operational impact"}, {"id": "PE:11", "title": "Respond to issues", "description": "Handle performance problems"}, {"id": "PE:12", "title": "Continuous optimization", "description": "Ongoing performance improvement"}]}
  },
  "serviceGuides": {
    "azure-kubernetes-service": {"service": "azure-kubernetes-service", "content": "Azure Kubernetes Service (AKS) Well-Architected guidance covering cluster design, node pool configuration, networking, security, and operational excellence for containerized workloads.", "recommendationIds": ["RE:01", "RE:05", "RE:10", "SE:04", "SE:05", "SE:06", "CO:07", "OE:05", "OE:10", "PE:03", "PE:05"]},
    "azure-blob-storage": {"service": "azure-blob-storage", "content": "Azure Blob Storage Well-Architected guidance for optimal performance, security, and cost management of object storage workloads.", "recommendationIds": ["RE:06", "SE:03", "SE:07", "CO:10", "PE:06", "PE:08"]},
    "azure-virtual-machines": {"service": "azure-virtual-machines", "content": "Azure Virtual Machines Well-Architected guidance covering VM sizing, availability sets, managed disks, and operational best practices.", "recommendationIds": ["RE:01", "RE:04", "SE:08", "CO:06", "CO:07", "OE:05", "PE:02", "PE:03"]},
    "azure-sql-database": {"service": "azure-sql-database", "content": "Azure SQL Database Well-Architected guidance for high availability, disaster recovery, security, and performance optimization of relational database workloads.", "recommendationIds": ["RE:04", "RE:06", "RE:09", "SE:03", "SE:07", "CO:07", "PE:06", "PE:08"]},
    "azure-app-service": {"service": "azure-app-service", "content": "Azure App Service Well-Architected guidance for web applications covering scaling, deployment slots, security, and monitoring.", "recommendationIds": ["RE:05", "SE:05", "SE:09", "CO:06", "OE:06", "OE:07", "PE:05"]},
    "azure-functions": {"service": "azure-functions", "content": "Azure Functions Well-Architected guidance for serverless compute including consumption plans, durable functions, and event-driven architectures.", "recommendationIds": ["RE:07", "SE:09", "CO:11", "CO:12", "OE:09", "PE:07"]},
    "azure-cosmos-db": {"service": "azure-cosmos-db", "content": "Azure Cosmos DB Well-Architected guidance for globally distributed databases covering consistency models, partitioning, and cost optimization.", "recommendationIds": ["RE:04", "RE:06", "SE:03", "CO:07", "CO:10", "PE:06", "PE:08"]},
    "azure-key-vault": {"service": "azure-key-vault", "content": "Azure Key Vault Well-Architected guidance for secrets management, key rotation, access policies, and integration with managed identities.", "recommendationIds": ["SE:05", "SE:07", "SE:09", "OE:05"]},
    "azure-front-door": {"service": "azure-front-door", "content": "Azure Front Door Well-Architected guidance for global routing, CDN, WAF, and SSL offloading for high-performance web applications.", "recommendationIds": ["RE:01", "SE:04", "CO:09", "PE:08", "PE:09"]},
    "azure-application-gateway": {"service": "azure-application-gateway", "content": "Azure Application Gateway Well-Architected guidance for layer 7 load balancing, WAF, and SSL termination.", "recommendationIds": ["RE:05", "SE:04", "SE:06", "PE:09"]},
    "azure-firewall": {"service": "azure-firewall", "content": "Azure Firewall Well-Architected guidance for network security, threat intelligence, and centralized policy management.", "recommendationIds": ["SE:04", "SE:06", "SE:10", "OE:05"]},
    "azure-monitor": {"service": "azure-monitor", "content": "Azure Monitor Well-Architected guidance for comprehensive observability including metrics, logs, and application insights.", "recommendationIds": ["RE:10", "SE:10", "OE:02", "PE:04", "PE:11"]},
    "azure-virtual-network": {"service": "azure-virtual-network", "content": "Azure Virtual Network Well-Architected guidance for network design, subnetting, NSGs, and hybrid connectivity.", "recommendationIds": ["RE:01", "SE:04", "SE:06", "PE:09"]},
    "azure-load-balancer": {"service": "azure-load-balancer", "content": "Azure Load Balancer Well-Architected guidance for layer 4 load balancing, health probes, and high availability.", "recommendationIds": ["RE:01", "RE:05", "PE:05", "PE:09"]},
    "azure-container-apps": {"service": "azure-container-apps", "content": "Azure Container Apps Well-Architected guidance for serverless container workloads, KEDA-based scaling, and Dapr integration.", "recommendationIds": ["RE:05", "SE:05", "CO:12", "OE:09", "PE:05", "PE:07"]}
  }
}